# Brewfile by tobark
tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line JavaScript / TypeScript engine
brew "deno"
# GNU Emacs text editor
brew "emacs"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Feature-rich console based todo list manager
brew "tig"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
brew "zsh"
cask "1password"
cask "alfred"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "visual-studio-code"
