tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "bat"
brew "dog"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "jq"
brew "keychain"
brew "lcdf-typetools"
brew "mas"
brew "mosh"
brew "neovim"
brew "openssh"
brew "pastel"
brew "ripgrep"
brew "shellcheck"
brew "tig"
brew "tmux"

# Brew cask
cask "1password"
cask "raycast"
cask "notion"
cask "spotify"
cask "iina"
cask "kap"
## Development
cask "zed"
cask "visual-studio-code"
cask "warp"
cask "iterm2"
## Design
cask "figma"
cask "framer"
## Web browsers
cask "google-chrome"
cask "arc"
cask "firefox"
## Messengers
cask "telegram-desktop"
cask "discord"
cask "slack"
## Utility
cask "karabiner-elements"
cask "kawa"
cask "gureumkim"
cask "linearmouse"
cask "disk-inventory-x"
cask "coconutbattery"
cask "aldente"
cask "bartender"
cask "rectangle"
cask "monitorcontrol"

# Brew cask fonts
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-noto-serif"
cask "font-noto-serif-cjk"
cask "font-sf-mono"

# Mac App Store
mas "Dato", id: 1470584107
mas "Shazam", id: 897118787
mas "Skitch", id: 425955336
mas "Things", id: 904280696
mas "Leaf", id: 576338668
mas "Drafts", id: 1435957248
