tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "bash"
brew "bat"
brew "deno"
brew "emacs"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "jq"
brew "keychain"
brew "lcdf-typetools"
brew "mas"
brew "mosh"
brew "neovim"
brew "openssh"
brew "pastel"
brew "ripgrep"
brew "shellcheck"
brew "tig"
brew "tmux"
brew "trash-cli"
brew "zsh"

# Brew cask
cask "1password"
cask "alfred"
cask "bartender"
cask "coconutbattery"
cask "discord"
cask "disk-inventory-x"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "grammarly"
cask "gitify"
cask "iina"
cask "iterm2"
cask "keybase"
cask "lyricsx"
cask "notion"
cask "qbittorrent"
cask "sequel-pro"
cask "slack"
cask "simplenote"
cask "spotify"
cask "telegram-desktop"
cask "visual-studio-code"

# Brew cask fonts
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-noto-serif"
cask "font-noto-serif-cjk"

# Mac App Store
mas "Dato", id: 1470584107
mas "DoOneThing", id: 464910442
mas "Dropzone 3", id: 695406827
mas "Magnet", id: 441258766
mas "Shazam", id: 897118787
mas "Skitch", id: 425955336
mas "Things", id: 904280696
mas "Leaf" id: 576338668

# These may take a lot of time to download.
# cask "blender"
# cask "unity-hub"
# mas "Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Keynote", id: 409183694
# mas "Xcode", id: 497799835
