tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "chezmoi"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "python@3.13"
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "felixkratz/formulae/sketchybar"
brew "tailscale"
brew "trash-cli", link: true
brew "watchman"
brew "zellij"
cask "nikitabobko/tap/aerospace"
cask "appcleaner"
cask "betterdisplay"
cask "bitwarden"
cask "coconutbattery"
cask "discord"
cask "figma"
cask "firefox"
cask "font-sarasa-gothic"
cask "font-sf-mono"
cask "ghostty"
cask "google-chrome"
cask "gureumkim"
cask "iina"
cask "input-source-pro"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "linearmouse"
cask "monitorcontrol"
cask "notion"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "spotify"
cask "swiftdefaultappsprefpane"
cask "telegram-desktop"
cask "visual-studio-code"
cask "zed@preview"
mas "Pure Paste", id: 1611378436
mas "Skitch", id: 425955336
mas "Velja", id: 1607635845

